
const DoctorItem = (props) => {
  return (
    <div className='xl:w-1/4 md:w-1/2 p-4'>
      <div className='bg-gray-100 p-6 rounded-lg'>
        <img className='h-40 rounded w-full object-cover object-center mb-6' src={props.img} alt='content' />
        <h3 className='tracking-widest text-purple-500 text-xs font-medium title-font'>{props.spec}</h3>
        <h2 className="text-lg text-gray-900 font-medium title-font mb-4">{props.name}</h2>
        <p className='leading-relaxed text-base'>{props.desc}</p>
      </div>
    </div>
  )
}

const Doctor = () => {
  const doctors = [
    {
      img: "/images/doctor8.jpg",
      spec: "ЛІКАР-СТОМАТОЛОГ",
      name: "Гнатюк Тетяна",
      desc: "У 2012 році закінчила Луганський національний аграрний університет. З 4 курсу проходила практику у ветеринарних клініках. З 2012 року працює ветеринарним лікарем. Брала участь у кількох десятках різних конгресів, семінарах та майстер-класах, присвячених темі ветеринарної стоматології та хірургії дрібних домашніх тварин."
    },
    {
      img: "/images/doctor7.jpg",
      spec: "ЛІКАР-КОТОТЕРАПЕВТ",
      name: "Дмитренко Кіра",
      desc: "Я закінчила Київський державний університет харчових виробництв, спочатку працювала асистентом, потім лікарем в декількох клініках. З листопада 2019-го працюю у великому ветеринарному центрі, оснащеним необхідним і сучасним обладнанням, що дає більше можливостей для якісної діагностики та лікування."
    },
    {
      img: "/images/doctor6.jpg",
      spec: "ЛІКАР-ДЕРМАТОЛОГ",
      name: "Шевченко Дмитро",
      desc: "У 2012 році з червоним дипломом закінчив Київську державну академію ветеринарної медицини та біотехнології ім. К. І. Скрябіна. Також працював ветеринарним консультантом-дієтологом і асистентом ветеринарного лікаря в різних клініках. До практики лікаря приступив у 2014 році. У 2017 році пройшов підвищення кваліфікації і з тих пір спеціалізується на дерматології."
    },
    {
      img: "/images/doctor5.jpg",
      spec: "ЛІКАР-РЕНТГЕНОЛОГ",
      name: "Шинкаренко Василь",
      desc: "Закінчив Академію з відзнакою і продовжив працювати, в основному, у відділеннях хірургії та візуальної діагностики. Саме тоді я почав активно і поглиблено займатися рентгенологією. У 2020 році я закінчив аспірантуру на кафедрі анатомії Санкт-Петербурзького державного університету ветеринарної медицини, і в даний час, крім лікарської практики, займаюся науково-дослідною діяльністю."
    },
    {
      img: "/images/doctor4.jpg",
      spec: "ЛІКАР-ХІРУРГ",
      name: "Мірошниченко Вадим",
      desc: "Я вступив до академії імені Скрябіна, щоб отримати спеціальність «ветеринарний лікар». Коли на третьому курсі ми стали вивчати хірургію, я, нарешті, зрозумів, чим би мені хотілося займатися. З цього моменту я активно відвідував додаткові заняття з хірургії, ветеринарні конгреси та семінари. Спробував розвиватися в різних напрямках і, через вісім років, виділив для себе найцікавіші і значущі дисципліни: ендоскопія, мягкотканная і Онкохірургія."
    },
    {
      img: "/images/doctor3.jpg",
      spec: "ЛІКАР - ЭКЗОТОЛОГ",
      name: "Іванченко Любов",
      desc: "Я закінчила академію імені Скрябіна і, прийшовши на роботу в клініку, відразу вирішила стати лікарем по «екзотам». До того як почати практикувати самостійно, я була асистентом у відділенні ветеринарії екзотичних тварин, побувала на посадах молодшого медперсоналу практично в кожному відділенні — в терапії, хірургії, в інфекційному і терапевтичному стаціонарі, трохи в інтенсивній терапії."
    },
    {
      img: "/images/doctor2.jpg",
      spec: "ЛІКАР-КАРДІОЛОГ",
      name: "Антоненко Ольга",
      desc: "У 2020 році закінчила Нижегородську державну академію за спеціальністю Ветеринарія. Почала свій шлях з асистента і виросла у ветеринарного лікаря. З 2018 по 2021 роки працювала у ветеринарній клініці в Нижньому Новгороді. Поєднувала функції ветеринарного лікаря-кардіолога, лікаря УЗД і загального прийому."
    },
    {
      img: "/images/doctor1.jpg",
      spec: "ЛІКАР-НЕВРОЛОГ",
      name: "Гнатюк Надія",
      desc: "З відзнакою закінчила Київську державну академію ветеринарної медицини ім. Скрябіна. У 2006 році пройшла курс з електроенцефалографії дрібних домашніх тварин на базі «Нейрософт» в м Іваново. Працювати за фахом стала ще на останніх курсах інституту. Спочатку була цікава офтальмологія: заворожувала Краса очного дна у тварин. Так вийшло, що саме очне дно, Діагностика його стану, привела мене в іншу спеціалізацію — неврологію."
    }
  ]
  

  return (
    <>
      <section className="text-gray-600 body-font">
        <div class="container px-5 py-24 mx-auto">
          <div class="flex flex-wrap -m-4">
            {doctors.map((doctor, index) => {
              return (<DoctorItem img={doctor.img} spec={doctor.spec} name={doctor.name} desc={doctor.desc} />)
            })}
          </div>
        </div>
      </section>
    </>
  )
}

export default Doctor